#include "mmemory.h"

//	///////////////////////////////////////
//	va	- виртуальный адрес
//	vas - виртуальное адресное пространство
//
//	p	- физический
//	pa	- физический адрес
//	pas - физическое адресное пространство
//	///////////////////////////////////////

typedef char* PA;						// Тип, описывающий физический адрес

#define _PAS_MAX_SIZE 1024				// Максимальный размер физического адресного пространства (в байтах)
#define _VAS_MAX_SIZE _PAS_MAX_SIZE		// Максимальный размер виртуального адресного пространства (в байтах)
#define _FORBIDDEN_ADRESS_INDEX -1		// Индекс ячейки, которая находится вне памяти

PA*		_pas;							// Физическое адресное пространство
VA*		_vas;							// Виртуальное адресное пространство

size_t	_pas_size;						// Текущий размер физического адресного пространства
size_t	_vas_size;						// Текущий размер виртуального адресного пространства

int		_first_free_va_index;			// Индекс первой свободной ячейки виртуального адресного пространства
int		_first_free_pa_index;			// Индекс первой свободной ячейки физического адресного пространства

int		_init_pas(size_t size);
int		_init_vas (size_t size);
PA		_validate_pa (PA va);
VA		_validate_va (VA va);
void	_defragment_vas ();

void	_print_vas ();
void	_print_pas ();
