#include "mmemory.h"

//	///////////////////////////////////////
//	va	- виртуальный адрес
//	vas - виртуальное адресное пространство
//
//	p	- физический
//	pa	- физический адрес
//	pas - физическое адресное пространство
//	///////////////////////////////////////

typedef char* PA;					// “ип, описывающий физический адрес


#define PAS_MAX_SIZE (1024)			// ћаксимальный размер физического адресного пространства
#define VAS_MAX_SIZE PAS_MAX_SIZE	// ћаксимальный размер виртуального адресного пространства

PA _pas[PAS_MAX_SIZE];				// ‘изическое адресное пространство
VA _vas[VAS_MAX_SIZE];				// ¬иртуальное адресное пространство
